# VarSketchFailure Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..VarSketchFailure Property
BuiltInFailures..::..SketchFailures Class See Also
---
Constraints defined by highlighted Lines and Dimensions can't be satisfied.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId VarSketchFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property VarSketchFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ VarSketchFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace